tests/assets/py_lt_314/snapshots/attrs_nested_types.dot
digraph "Entity Relationship Diagram created by erdantic" {
	graph [fontcolor=gray66,
		fontname="Times New Roman,Times,Liberation Serif,serif",
		fontsize=9,
		label="Created by erdantic vTEST <https://github.com/drivendataorg/erdantic>",
		nodesep=0.5,
		rankdir=LR,
		ranksep=1.5
	];
	node [fontname="Times New Roman,Times,Liberation Serif,serif",
		fontsize=14,
		label="\N",
		shape=plain
	];
	edge [dir=both];
	"tests.snapshot_cases.AttrsNestedTypes"	[label=<<table border="0" cellborder="1" cellspacing="0"><tr><td port="_root" colspan="2"><b>AttrsNestedTypes</b></td></tr><tr><td>node_map</td><td port="node_map">dict[str, Optional[AttrsRelatedNode]]</td></tr><tr><td>node_groups</td><td port="node_groups">list[list[AttrsRelatedNode]]</td></tr></table>>,
		tooltip="tests.snapshot_cases.AttrsNestedTypes"];
	"tests.snapshot_cases.AttrsRelatedNode"	[label=<<table border="0" cellborder="1" cellspacing="0"><tr><td port="_root" colspan="2"><b>AttrsRelatedNode</b></td></tr><tr><td>name</td><td port="name">str</td></tr></table>>,
		tooltip="tests.snapshot_cases.AttrsRelatedNode"];
	"tests.snapshot_cases.AttrsNestedTypes":node_groups:e -> "tests.snapshot_cases.AttrsRelatedNode":_root:w	[arrowhead=crownone,
		arrowtail=nonenone];
	"tests.snapshot_cases.AttrsNestedTypes":node_map:e -> "tests.snapshot_cases.AttrsRelatedNode":_root:w	[arrowhead=crownone,
		arrowtail=nonenone];
}
